---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthAll
source: html/fe5490b8-134d-009b-b63e-fe46b7e420d1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesGapForWidthAll Property

Division family cannot be used with the selected division gap for all widths of hosts

## Syntax (C#)
```csharp
public static FailureDefinitionId DivideVolumesProfilesGapForWidthAll { get; }
```